backend/app/Controllers/MemberManage.php

SELECT *
FROM `members`
WHERE `m_id` = '3'
AND `members`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `members` SET `m_password` = NULL, `updated_at` = '2024-02-04 20:26:50'
WHERE `members`.`m_id` IN ('1')
---
    public function update()
    {
        //$data = $this->request->getJSON(true);
        $data = $this->request->getPost();

        $m_id = session()->get("memberdata")->m_id;

        $membersModel = new MembersModel();
        $verifyUserData = $membersModel->where("m_id", $m_id)->first();

        if($verifyUserData === null) {
            return $this->fail("查無此帳號", 404);
        }

        $password   = $data['password'] ?? null;
        $repassword = $data['repassword'] ?? null;

        if($password != $repassword) {
            return $this->fail("密碼驗證錯誤", 403);
        }else{
            $updateValues = [
                'm_password' =>  password_hash($password, PASSWORD_DEFAULT),
            ];
            $membersModel->update($verifyUserData['m_id'], $updateValues);