backend/app/Controllers/MembersController.php

    public function login()
    {
        $data = $this->request->getPost();

        $account    = $data['account'] ?? null;
        $password   = $data['password'] ?? null;

        if($account === null || $password === null) {
            return $this->fail("需帳號密碼進行登入", 404);
        }

        if($account === " " || $password === " ") {
            return $this->fail("需帳號密碼進行登入", 404);
        }

        $membersModel = new MembersModel();
        $memberData  = $membersModel->where("m_account", $account)->first();
---
SELECT *
FROM `members`
WHERE `m_account` = 'test1'
AND `members`.`deleted_at` IS NULL
 LIMIT 1

    public function register()
    {
        $data = $this->request->getPost();

        $account    = $data['account'] ?? null;
        $password   = $data['password'] ?? null;
        $repassword = $data['repassword'] ?? null;

        if($account === null || $password === null || $repassword === null) {
            return $this->fail("需帳號密碼進行註冊", 404);
        }

        if($account === " " || $password === " " || $repassword === " ") {
            return $this->fail("需帳號密碼進行註冊", 404);
        }

        if($password != $repassword) {
            return $this->fail("密碼驗證錯誤", 403);
        }

        $membersModel = new MembersModel();
        $memberData  = $membersModel->where("m_account", $account)->first();
---
SELECT *
FROM `members`
WHERE `m_account` = 'test3'
AND `members`.`deleted_at` IS NULL
 LIMIT 1

            'm_account'  =>  $account,
            'm_password' =>  password_hash($password, PASSWORD_DEFAULT),
        ];
        $membersModel->insert($values);
---
INSERT INTO `members` (`m_account`, `m_password`, `created_at`, `updated_at`) VALUES ('test3', '$2y$10$pTELunR6Gi/YABd3xzLrKucSgZCkrHptWr20mm/2p0jfXiLU8wb.y', '2024-02-04 20:18:40', '2024-02-04 20:18:40')